#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database_role.owner will be created
  + resource "snowflake_database_role" "owner" {
      + database             = "PRODUCTION"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PRODUCTION_DEMO_O"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read will be created
  + resource "snowflake_database_role" "read" {
      + database             = "PRODUCTION"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PRODUCTION_DEMO_R"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read_write will be created
  + resource "snowflake_database_role" "read_write" {
      + database             = "PRODUCTION"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_PRODUCTION_DEMO_RW"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_grant_database_role.o_inherits_rw will be created
  + resource "snowflake_grant_database_role" "o_inherits_rw" {
      + database_role_name        = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
    }

  # module.snowflake_resources.snowflake_grant_database_role.rw_inherits_r will be created
  + resource "snowflake_grant_database_role" "rw_inherits_r" {
      + database_role_name        = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                        = (known after apply)
      + parent_database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
    }

  # module.snowflake_resources.snowflake_grant_ownership.all_tables_in_schema will be created
  + resource "snowflake_grant_ownership" "all_tables_in_schema" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_dynamic_tables will be created
  + resource "snowflake_grant_ownership" "future_dynamic_tables" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_file_formats will be created
  + resource "snowflake_grant_ownership" "future_file_formats" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FILE FORMATS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_functions will be created
  + resource "snowflake_grant_ownership" "future_functions" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_materialized_views will be created
  + resource "snowflake_grant_ownership" "future_materialized_views" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_procedures will be created
  + resource "snowflake_grant_ownership" "future_procedures" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_sequences will be created
  + resource "snowflake_grant_ownership" "future_sequences" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_stages will be created
  + resource "snowflake_grant_ownership" "future_stages" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "STAGES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_streams will be created
  + resource "snowflake_grant_ownership" "future_streams" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "STREAMS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_tables_in_schema will be created
  + resource "snowflake_grant_ownership" "future_tables_in_schema" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_tasks will be created
  + resource "snowflake_grant_ownership" "future_tasks" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TASKS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_ownership.future_views will be created
  + resource "snowflake_grant_ownership" "future_views" {
      + database_role_name  = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_O\""
      + id                  = (known after apply)
      + outbound_privileges = "COPY"

      + on {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["DYNAMIC TABLES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "MONITOR",
          + "OPERATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["FILE FORMATS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FILE FORMATS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["FUNCTIONS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["MATERIALIZED VIEWS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "EVOLVE SCHEMA",
          + "INSERT",
          + "REBUILD",
          + "REFERENCES",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["PROCEDURES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["STAGES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "STAGES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["TABLES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "EVOLVE SCHEMA",
          + "INSERT",
          + "REBUILD",
          + "REFERENCES",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["TASKS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "MONITOR",
          + "OPERATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TASKS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_all_on_objects["VIEWS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_all_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "REBUILD",
          + "REFERENCES",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_create_on_schema will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_create_on_schema" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "CREATE DYNAMIC TABLE",
          + "CREATE FILE FORMAT",
          + "CREATE FUNCTION",
          + "CREATE MATERIALIZED VIEW",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE TEMPORARY TABLE",
          + "CREATE VIEW",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "\"PRODUCTION\".\"DEMO\""
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["FILE FORMATS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FILE FORMATS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["FUNCTIONS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["MATERIALIZED VIEWS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "EVOLVE SCHEMA",
          + "INSERT",
          + "REBUILD",
          + "REFERENCES",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["PROCEDURES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["STAGES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "STAGES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["TABLES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "EVOLVE SCHEMA",
          + "INSERT",
          + "REBUILD",
          + "REFERENCES",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_future_on_objects["VIEWS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_future_on_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_RW\""
      + id                 = (known after apply)
      + privileges         = [
          + "REBUILD",
          + "REFERENCES",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["DYNAMIC TABLES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["FUNCTIONS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["MATERIALIZED VIEWS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["PROCEDURES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["SEQUENCES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["TABLES_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_all_objects["VIEWS_all"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_all_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + all {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["DYNAMIC TABLES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "DYNAMIC TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["FUNCTIONS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["MATERIALIZED VIEWS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "MATERIALIZED VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["PROCEDURES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["SEQUENCES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["TABLES_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.grant_on_future_objects["VIEWS_future"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "grant_on_future_objects" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "\"PRODUCTION\".\"DEMO\""
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r will be created
  + resource "snowflake_grant_privileges_to_database_role" "usage_to_r" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"PRODUCTION\".\"ROLE_PRODUCTION_DEMO_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "\"PRODUCTION\".\"DEMO\""
        }
    }

Plan: 49 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Abhinandan90, Action: `pull_request`*